app/views/requests/index.html.haml

-@activerequests.each do |request|
  %h3= "Request from Player: #{User.find(request.player_id).username} - Session: #{Session.find(request.session_id).title}"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."session_id" = ?  [["session_id", 7]]