app/controllers/homes_controller.rb

  def create
    authorize! :create, Home, :message => "You can't change your role"
    role = params[:user][:roles_mask]
    #Rails.logger.debug("Salveeee #{role}")
    current_user.update_attributes(:roles_mask => role)
---
UPDATE "users" SET "roles_mask" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["roles_mask", 1], ["updated_at", "2018-06-02 19:16:03.802562"], ["id", 7]]