app/controllers/invitations_controller.rb

  def index
    @username = current_user.username
    @id = current_user.id
    @invitations = Invitation.where(:player_id => @id)
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."player_id" = ?  [["player_id", 0]]

  def new
    #metodo per visualizzare gli utenti che possono essere invitati
    @username = current_user.username
    id = params[:s_id]
    puts id
    @session = Session.find(id)
    @eligibleusers = User.where("roles_mask == 2").where(:invitation_flag => true)
---
SELECT "users".* FROM "users" WHERE (roles_mask == 2) AND "users"."invitation_flag" = ?  [["invitation_flag", 1]]

  def inviting
    s_id = params[:s_id]
    p_id = params[:p_id]
    @invitation = Invitation.create!(:session_id => s_id,:player_id => p_id)
---
INSERT INTO "invitations" ("session_id", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["session_id", 6], ["player_id", 5], ["created_at", "2018-06-02 18:05:11.973794"], ["updated_at", "2018-06-02 18:05:11.973794"]]

  def accept
    s_id = params[:s_id]
    p_id = params[:p_id]
    Invitation.where(:session_id => s_id).where(:player_id => p_id).first.delete
    @partecipations = Partecipation.create!(:session_id => s_id, :player_id => p_id)
---
DELETE FROM "invitations" WHERE "invitations"."id" = ?  [["id", 1]]
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."session_id" = ? AND "invitations"."player_id" = ? ORDER BY "invitations"."id" ASC LIMIT ?  [["session_id", 6], ["player_id", 5], ["LIMIT", 1]]
INSERT INTO "partecipations" ("session_id", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["session_id", 6], ["player_id", 5], ["created_at", "2018-06-02 17:36:36.802726"], ["updated_at", "2018-06-02 17:36:36.802726"]]