app/controllers/matches_controller.rb

  def new
    authorize! :new, Match, :message => "You can't create matches"
    id = params[:session_id]
    @session = Session.find(id)
    if current_user.id != @session.master_id
      redirect_to home_path
    end
    @master_username = User.find(@session.master_id).username
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    authorize! :create, Match, :message => "You can't create matches"
    id = params[:session_id]
    @session = Session.find(id)
    if @session.master_id != current_user.id
      redirect_to home_path
    end
    @session.update(status:2)
    @master_username = User.find(@session.master_id).username
    @matches=Match.all
    @matches.each do |match|
      if match.status==true
        flash[:notice] = "There is already the match #{match.title} to play. Close it before creating another one"
        redirect_to session_path(@session) and return
      end
    end
  	@match = @session.matches.create!(params[:match].permit(:title, :data))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "matches".* FROM "matches"
INSERT INTO "matches" ("session_id", "title", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["session_id", 1], ["title", "match1"], ["data", "2018-06-01 00:00:00"], ["created_at", "2018-06-01 22:52:56.033974"], ["updated_at", "2018-06-01 22:52:56.033974"]]

  def show
    authorize! :show, Match, :message => "You can't see matches"
    id = params[:session_id]
    @session = Session.find(id)
    id = params[:id]
    if current_user.has_role?(:master) and current_user.id != @session.master_id
      redirect_to home_path
    end
    @match=Match.find(id)
    @master_username = User.find(@session.master_id).username
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show_current
    authorize! :show_current, Match, :message => "You can't see current match"
    id = params[:session_id]
    current_user.update(current_session_id: id)
    if current_user.has_role?(:player)
        @partecipationmatch = Partecipationsmatch.where(:player_id => current_user.id)
    end
    @session = Session.find(id)
    if current_user.has_role?(:master) and current_user.id != @session.master_id
      redirect_to home_path
    end
    @matches=@session.matches
    @matches.each do |match|
        if match.status==true
            @match=match
            current_user.update(current_match_id: @match.id)
            @username = current_user.username
            @master_username = User.find(@session.master_id).username
---
SELECT "matches".* FROM "matches" WHERE "matches"."session_id" = ?  [["session_id", 1]]
UPDATE "matches" SET "summary" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["summary", "summary"], ["updated_at", "2018-06-01 23:04:08.633937"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def like
    authorize! :like, Match, :message => "You can't add like"
    id = params[:session_id]
    @session = Session.find(id)
    id_match = params[:match_id]
  	@match = Match.find(id_match)
  	if @match.like.present?
  	  l = @match.like + 1
  	else
  	  l = 1
  	end
  	@match.update(like: l)
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "matches" SET "status" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["status", 0], ["updated_at", "2018-06-02 17:37:57.316985"], ["id", 1]]

  def add_photo
    authorize! :add_photo, Match, :message => "You can't add photos"
    id = params[:session_id]
    @session = Session.find(id)
    id = params[:match_id]
    @match = Match.find(id)
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def close
    authorize! :close, Match, :message => "You can't close matches"
    @username = current_user.username
    id = params[:session_id]
    @session = Session.find(id)
    id = params[:id]
	  @match = Match.find(id)
    if @session.master_id != current_user.id
      redirect_to session_match_path(@session,@match)
    end
    @master_username = User.find(@session.master_id).username
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def summary
    authorize! :summary, Match, :message => "You can't change summary"
    s_id = params[:session_id]
    @session = Session.find(s_id)
    m_id = params[:match_id]
  	@match = Match.find(m_id)
    if @session.master_id != current_user.id
      redirect_to session_match_path(@session,@match)
    end
  	@match.update_attributes!(params[:match].permit(:summary))
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "matches" SET "summary" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["summary", "summary"], ["updated_at", "2018-06-01 23:04:08.633937"], ["id", 1]]