app/controllers/omniauth_callbacks_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "username", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "google_oauth2"], ["uid", "110126984668945540313"], ["LIMIT", 1]]
---
  def google_oauth2
    auth = request.env["omniauth.auth"]
    user = User.where(provider: auth.provider, uid: auth.uid)
            .first_or_create(email: auth.info.email, password: Devise.friendly_token[0,20], username: auth.info.name)

INSERT INTO "users" ("email", "encrypted_password", "username", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "github"], ["uid", "32673321"], ["LIMIT", 1]]
---
  def github
    auth = request.env["omniauth.auth"]
    user = User.where(provider: auth.provider, uid: auth.uid)
            .first_or_create(email: auth.info.nickname + "@gmail.com", password: Devise.friendly_token[0,20], username: auth.info.nickname)