app/controllers/partecipationsmatch_controller.rb

    def create
      authorize! :create, Partecipationsmatch, :message => "You can't create match's partecipations"
      s_id = params[:session_id]
      @session = Session.find(s_id)
      m_id = params[:match_id]
    	@match = Match.find(m_id)
      @partecipationmatch = Partecipationsmatch.create(:session_id => s_id,:match_id => m_id, :player_id => current_user.id)
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "partecipationsmatches" ("session_id", "match_id", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["session_id", 1], ["match_id", 2], ["player_id", 2], ["created_at", "2018-06-02 18:31:41.244458"], ["updated_at", "2018-06-02 18:31:41.244458"]]