app/controllers/partecipations_controller.rb

  def create
    authorize! :create, Partecipation, :message => "You can't create partecipations"
    #post per creare una nuova partecipazione, associata all'index del request e al tasto join del player
    r_id = params[:session_id] #to change
    request = Request.find(r_id)
    if current_user.has_role?(:master) and Session.find(r_id).master_id != current_user.id
      redirect_to home_path
    elsif current_user.has_role?(:player) and request.player_id == current_user.id
      redirect_to home_path
    @partecipation = Partecipation.create!(:session_id => request.session_id,:player_id => request.player_id)
    Request.find(r_id).delete
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "partecipations" ("session_id", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["session_id", 10], ["player_id", 10], ["created_at", "2018-06-01 14:14:00.428513"], ["updated_at", "2018-06-01 14:14:00.428513"]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 10]]