app/controllers/requests_controller.rb

INSERT INTO "requests" ("player_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["player_id", 3], ["created_at", "2018-06-01 12:28:44.603558"], ["updated_at", "2018-06-01 12:28:44.603558"]]
---
  def create
    authorize! :create, Request, :message => "You can't create request"
    id = current_user.id
    s_id = params[:id]
    @request = Request.create!(:session_id => s_id,:player_id => id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."session_id" = ?  [["session_id", 7]]
---
  def index
    authorize! :index, Request, :message => "You can't see pending request"
  #mochup: pendingrequest
    @username = current_user.username
    s_id = params[:id]
    if current_user.id != Session.find(s_id).master_id
      redirect_to home_path
    end
    @activerequests = Request.where(:session_id => s_id)