app/controllers/sessions_controller.rb

  def show
    #controller per visualizzare la sessione (mockup: session)
    @username = current_user.username
    id = params[:id]
    @session = Session.find(id)
    partecipations = Partecipation.where(:session_id => id)
    @partecipants = partecipations.map { |x| User.find(x.player_id) }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]