app/controllers/sessions_controller.rb

SELECT "partecipations".* FROM "partecipations" WHERE "partecipations"."player_id" = ?  [["player_id", 2]]
---
  def showactive
    @username = current_user.username
    if current_user.has_role?(:master)
        @mysessions = Session.where(:master_id => current_user.id)
        @activesessions = @mysessions.where(:status => 2)
    elsif current_user.has_role?(:player)
        @partecipations=Partecipation.where(:player_id => current_user.id)

SELECT "partecipations".* FROM "partecipations" WHERE "partecipations"."player_id" = ?  [["player_id", 9]]
---
  def showclosed
    @username = current_user.username
    if current_user.has_role?(:master)
        @mysessions = Session.where(:master_id => current_user.id)
        @closedsessions = @mysessions.where(:status => 3)
    elsif current_user.has_role?(:player)
        @partecipations=Partecipation.where(:player_id => current_user.id)
        @closedsessions=[]
        @partecipations.each do |p|

SELECT "partecipations".* FROM "partecipations" WHERE "partecipations"."player_id" = ?  [["player_id", 9]]
---
  def showjoined
    @username = current_user.username
    @partecipations=Partecipation.where(:player_id => current_user.id)
    @joinedsessions=[]
    @partecipations.each do |p|

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "partecipations".* FROM "partecipations" WHERE "partecipations"."session_id" = ? ORDER BY "partecipations"."id" ASC LIMIT ?  [["session_id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "partecipations".* FROM "partecipations" WHERE "partecipations"."session_id" = ?  [["session_id", 8]]
---
  def show
    #controller per visualizzare la sessione (mockup: session)
    @username = current_user.username
    id = params[:id]
    @session = Session.find(id)
    @master_username = User.find(@session.master_id).username
    partecipations = Partecipation.where(:session_id => id)
    @partecipants = partecipations.map { |x| User.find(x.player_id) }

DELETE FROM "partecipations" WHERE "partecipations"."id" = ?  [["id", 3]]
SELECT  "partecipations".* FROM "partecipations" WHERE "partecipations"."session_id" = ? AND "partecipations"."player_id" = ? ORDER BY "partecipations"."id" ASC LIMIT ?  [["session_id", 4], ["player_id", 2], ["LIMIT", 1]]
---
  def exit
    #user decide di lasciare la sessione
    s_id = params[:session_id]
    p_id = current_user.id
    Partecipation.where(:session_id=>s_id).where(:player_id=>p_id).first.delete