app/controllers/sessions_controller.rb

  def show
    authorize! :show, Session, :message => "You can't see session"
    #controller per visualizzare la sessione (mockup: session)
    @username = current_user.username
    id = params[:id]
    @session = Session.find(id)
    if @session.status == 1
      @status = "Created"
    elsif @session.status == 2
      @status = "Active"
    elsif @session.status == 3
      @status = "Closed"
    end
    @master_username = User.find(@session.master_id).username
    if current_user.has_role?(:master) and current_user.id != @session.master_id
      redirect_to home_path
    end
    partecipations = Partecipation.where(:session_id => id)
    @partecipants = partecipations.map { |x| User.find(x.player_id) }
    @val = Partecipation.where(:session_id => id, :player_id => current_user.id).count
    @currentmatch = Match.where(:session_id => id, :status => true)
    if current_user.email.split("@")[1].to_s.casecmp?("test.com")
        @photos=[]
    else
        s="Session"+@session.title+"match"+@match.title
        @photos = Flickr.photos.search(user_id: "139197130@N06", title: s)
    end
    @latlong = Geocoder.coordinates(@session.location)
    @matches=Match.where(:session_id => id).count
---
SELECT COUNT(*) FROM "partecipations" WHERE "partecipations"."session_id" = ? AND "partecipations"."player_id" = ?  [["session_id", 1], ["player_id", 1]]
SELECT COUNT(*) FROM "matches" WHERE "matches"."session_id" = ?  [["session_id", 1]]