app/controllers/users_controller.rb

  def ban
    authorize! :ban, User, :message => "You can't ban users"
    #post associata al tasto kick del master
    s_id = params[:session_id]
    if Session.find(s_id).master_id != current_user.id
      redirect_to home_path
    end
    p_id = params[:player_id]
    Partecipation.where(:session_id=>s_id).where(:player_id=>p_id).first.delete
---
DELETE FROM "partecipations" WHERE "partecipations"."id" = ?  [["id", 1]]
SELECT  "partecipations".* FROM "partecipations" WHERE "partecipations"."session_id" = ? AND "partecipations"."player_id" = ? ORDER BY "partecipations"."id" ASC LIMIT ?  [["session_id", 2], ["player_id", 2], ["LIMIT", 1]]

  def blockinvitation
    authorize! :blockinvitation, User, :message => "You can't block invitations"
    #post per bloccare gli inviti di un utente
    current_user.update_attributes(:invitation_flag => false)
---
UPDATE "users" SET "invitation_flag" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["invitation_flag", 0], ["updated_at", "2018-06-02 19:57:06.523240"], ["id", 8]]